In [1]:
import pandas as pd

In [2]:
d = ['male','female','male','male','female']

In [3]:
pd.get_dummies(d)

   female  male
0       0     1
1       1     0
2       0     1
3       0     1
4       1     0

In [5]:
d1 = ['female','male','female','male','male','female']

In [6]:
pd.get_dummies(d1)

   female  male
0       1     0
1       0     1
2       1     0
3       0     1
4       0     1
5       1     0

In [7]:
pd.get_dummies(d1, drop_first=True)

   male
0     0
1     1
2     0
3     1
4     1
5     0

In [8]:
age_range = ['kid','old','Children','Adult']

In [9]:
pd.get_dummies(age_range)

   Adult  Children  kid  old
0      0         0    1    0
1      0         0    0    1
2      0         1    0    0
3      1         0    0    0

In [10]:
pd.get_dummies(age_range,drop_first=True)

   Children  kid  old
0         0    1    0
1         0    0    1
2         1    0    0
3         0    0    0